<a href="https://colab.research.google.com/github/KayKozaronek/03_Courses/blob/master/CourseMaterial_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Dataframes 
This notebook shows the most common functionalities of dataframes in Pandas and how to perform operations on them

Eg:
- asdf
-asdf
-adsf

A DataFrame is a tabular structure formed by a set of series, with a default index starting at 0

In [2]:
import pandas as pd
col1 = pd.Series(["Sergio","David","Natalia", "Daniel"])
col1

0     Sergio
1      David
2    Natalia
3     Daniel
dtype: object

In [3]:
col2 = pd.Series([30,10,11,27])
col2

0    30
1    10
2    11
3    27
dtype: int64

In [5]:
pd.DataFrame({"name": col1,
              "age": col2},
              columns =["name", "age"])

      name  age
0   Sergio   30
1    David   10
2  Natalia   11
3   Daniel   27

#Creating a DataFrame

When a DataFrame is created from a Series, Pandas takes into account the series indexes and cn create null values

In [7]:
serie1 = pd.Series([1,2],
                   index =["one", "two"])
print(serie1)

one    1
two    2
dtype: int64

In [9]:
serie2 = pd.Series([2,3],
                   index =["two", "three"])
print(serie2)

two      2
three    3
dtype: int64

In [12]:
df = pd.DataFrame({"c1": pd.Series([1,2], index = ["one", "two"]),
                   "c2": pd.Series([2,3], index =["two", "three"])},
                  columns = ["c1", "c2"],
                  index = ["one", "two", "three"])

print(df)

        c1   c2
one    1.0  NaN
two    2.0  2.0
three  NaN  3.0

Usually a DataFrame is created from a dictionary of lists containing the same elements

In [13]:
dictionary = {
    "name": ["Julio", "Nuria", "Jose", "Luis","Daniel"],
    "age" : [ 22,26,28,25,24],
    "sex" : ["M", "F", "M", "M", "M"]
    }

dataframe = pd.DataFrame(dictionary, columns = ["name", "age", "sex"])
print(dataframe)

     name  age sex
0   Julio   22   M
1   Nuria   26   F
2    Jose   28   M
3    Luis   25   M
4  Daniel   24   M

A DataFrame can also be created from 3 arrays: values, columns and rows

In [16]:
import numpy as np
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  columns=list("ABCD"),
                  index =("one","two","three", "four"))

print(df)

        A   B   C   D
one     0   1   2   3
two     4   5   6   7
three   8   9  10  11
four   12  13  14  15

These arrays can be accessed through the attributes **index**, **columns** and **values**

In [17]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [18]:
df.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

##Exercise 14
Create the following DataFrame, respecting the order of the columns, and assign it to the variable ‘df’
- name: 'Bulbasaur', 'Charmander', 'Squirtle','Caterpie'
- evolution: 'Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'
- type: 'grass', 'fire', 'water', 'bug'
- hp : 45, 39, 44, 45
- pokedex : 'yes', 'no', 'yes', 'no'

In [187]:
dictionary = {"name" : ["Bulbasaur", "Charmander", "Squirtle", "Carterpie"],
              "evolution" : ["Ivysaur","Charmeleon", "Wartortle","Metapod"],
              "hp" : [45,39,44,45],
              "pokedex" : ["Yes","No","Yes","No"],
              "type" : ["Grass","Fire","Water","Bug"]}

pokeframe = pd.DataFrame(dictionary,
                  index = ["A","B","C","D"])
print(pokeframe)

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water
D   Carterpie     Metapod  45      No    Bug

##Transposing a DataFrame
The dataframe attribute T allows you to transpose a dataframe (for instance to change rows by columns)

In [42]:
df = pd.DataFrame({
    "C1":np.arange(1,5),
    "C2": np.repeat("Smaller than 5", 4 )
})

df

   C1              C2
0   1  Smaller than 5
1   2  Smaller than 5
2   3  Smaller than 5
3   4  Smaller than 5

In [43]:
df.T

                 0               1               2               3
C1               1               2               3               4
C2  Smaller than 5  Smaller than 5  Smaller than 5  Smaller than 5

## Exercise 15
Take the Dataframe from the previous exercise and transpose it. 
Display values, columns and row indexes

In [47]:
pokeframe.T

                   A           B          C          D
name       Bulbasaur  Charmander   Squirtle  Carterpie
evolution    Ivysaur  Charmeleon  Wartortle    Metapod
hp                45          39         44         45
pokedex          Yes          No        Yes         No
type           Grass        Fire      Water        Bug

## Selecting a column
Pandas allows access to a column in two ways: 
- Dataframe.column
- Dataframe["column"]

The object it returns is a Series

In [48]:
dictionary = {
    "n1": np.arange(1,5),
    "n2": np.arange(50,54)
}
dataframe = pd.DataFrame(dictionary)
dataframe

   n1  n2
0   1  50
1   2  51
2   3  52
3   4  53

In [49]:
dataframe.n1

0    1
1    2
2    3
3    4
Name: n1, dtype: int64

In [50]:
dataframe["n1"]

0    1
1    2
2    3
3    4
Name: n1, dtype: int64

# Multi-column selection

- To select a set of columns you need to specify a list of columns
- The object it returns is a new DataFrame

In [52]:
dataframe = pd.DataFrame(np.arange(1,16).reshape(3,5),
                         columns=["C1","C2","C3","C4","C5"],
                         index = list("ABC"))
dataframe

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15

In [54]:
dataframe[["C2", "C4"]]

   C2  C4
A   2   4
B   7   9
C  12  14

#Exercise 16
- Get the "name" column as a Series, using two different methods 
- Get the column "name" as a Dataframe

In [55]:
pokeframe

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water
D   Carterpie     Metapod  45      No    Bug

In [57]:
print(pokeframe.name)
print(f"\n")
print(pokeframe["name"])

A     Bulbasaur
B    Charmander
C      Squirtle
D     Carterpie
Name: name, dtype: object


A     Bulbasaur
B    Charmander
C      Squirtle
D     Carterpie
Name: name, dtype: object

In [58]:
pokeframe[["name"]]

         name
A   Bulbasaur
B  Charmander
C    Squirtle
D   Carterpie

## Selecting a subset of rows
To select a subset of rows we specify two numbers seperated by a colon (similar to lists)

In [59]:
dataframe

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15

In [60]:
dataframe[0:2]

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10

In [61]:
dataframe[-2:]

   C1  C2  C3  C4  C5
B   6   7   8   9  10
C  11  12  13  14  15

We could also use an array of logical values

In [62]:
dataframe[[False, True, False]]

   C1  C2  C3  C4  C5
B   6   7   8   9  10

In [63]:
dataframe[dataframe.index == "A"]

   C1  C2  C3  C4  C5
A   1   2   3   4   5

In [72]:
dataframe[ dataframe.C1 >6]

   C1  C2  C3  C4  C5
C  11  12  13  14  15

## Exercise 17
Use the pokeframe again.
- Select the first 3 rows
- Select the last 2 rows
- Select odd rows 
- Select all rows but in reverse order

In [74]:
pokeframe[:3]

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water

In [75]:
pokeframe[-2:]

        name  evolution  hp pokedex   type
C   Squirtle  Wartortle  44     Yes  Water
D  Carterpie    Metapod  45      No    Bug

In [77]:
pokeframe[1::2]

         name   evolution  hp pokedex  type
B  Charmander  Charmeleon  39      No  Fire
D   Carterpie     Metapod  45      No   Bug

In [78]:
pokeframe[::-1]

         name   evolution  hp pokedex   type
D   Carterpie     Metapod  45      No    Bug
C    Squirtle   Wartortle  44     Yes  Water
B  Charmander  Charmeleon  39      No   Fire
A   Bulbasaur     Ivysaur  45     Yes  Grass

## Selection of values by position
Pandas provides the `iloc` and `iat` attributes to selct values by position.

`iloc[rows,columns]`

In [79]:
dataframe.iloc[[0,2], [0,1,4]]

   C1  C2  C5
A   1   2   5
C  11  12  15

In [80]:
dataframe.iloc[[True,False,False], [0,1,4]]

   C1  C2  C5
A   1   2   5

In [81]:
dataframe.iloc[dataframe.index == "A", :]

   C1  C2  C3  C4  C5
A   1   2   3   4   5

With `iat` you can specify a single row/column and always return a value instead of a Dataframe

In [82]:
dataframe

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15

In [83]:
dataframe.iat[0,1]

2

In [84]:
dataframe.iat[0,-1]

5

## Exercise 18 
Use the pokeframe

- Select all columns, 2nd and 4th row
- Select the "hp" and "type" columns of all rows
- Select the column "name" from the first and last row
- Get the value that is located in the first row, last column

In [85]:
pokeframe

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water
D   Carterpie     Metapod  45      No    Bug

In [88]:
pokeframe.iloc[[1,3]]

         name   evolution  hp pokedex  type
B  Charmander  Charmeleon  39      No  Fire
D   Carterpie     Metapod  45      No   Bug

In [101]:
pokeframe.iloc[:, [False, False, True, False, True]]

   hp   type
A  45  Grass
B  39   Fire
C  44  Water
D  45    Bug

In [104]:
pokeframe.iloc[[0,-1], [0]]

        name
A  Bulbasaur
D  Carterpie

In [105]:
pokeframe.iat[0,-1]

'Grass'

## Selection of values via label

Pandas provides the loc and at attributes to select calues by tag: `loc[rows, columns]`

In [106]:
dataframe

   C1  C2  C3  C4  C5
A   1   2   3   4   5
B   6   7   8   9  10
C  11  12  13  14  15

In [109]:
dataframe.loc["A":"B", ["C1", "C5"]]

   C1  C5
A   1   5
B   6  10

In [110]:
dataframe.loc[:,"C1":"C3"]

   C1  C2  C3
A   1   2   3
B   6   7   8
C  11  12  13

In [111]:
dataframe.loc[["A","C"],:]

   C1  C2  C3  C4  C5
A   1   2   3   4   5
C  11  12  13  14  15

In [112]:
dataframe.at["A","C2"]

2

## Exercise 19 
Use the pokeframe 
- Select all columns, 2nd and 4th row
- Select the "hp" and "type" columns of all rows
- Select the column "name" from the first and last row
- Select the value that is located in the first row, last column

In [114]:
pokeframe

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water
D   Carterpie     Metapod  45      No    Bug

In [115]:
pokeframe.loc[["B","D"],:]

         name   evolution  hp pokedex  type
B  Charmander  Charmeleon  39      No  Fire
D   Carterpie     Metapod  45      No   Bug

In [116]:
pokeframe.loc[:,["hp","type"]]

   hp   type
A  45  Grass
B  39   Fire
C  44  Water
D  45    Bug

In [121]:
pokeframe.loc[["A","D"], ["name"]]

        name
A  Bulbasaur
D  Carterpie

In [124]:
pokeframe.at["D","name"]

'Carterpie'

## Creating/Changing Columns 
- To change a new column, use the following syntax
`dataframe["column"] = array or list`
- If the column does nto exist, it will autoaticall be added to the DataFrame

In [125]:
dictionary

{'n1': array([1, 2, 3, 4]), 'n2': array([50, 51, 52, 53])}

In [126]:
dataframe = pd.DataFrame(dictionary)
dataframe

   n1  n2
0   1  50
1   2  51
2   3  52
3   4  53

In [127]:
dataframe["n3"] = [10,25,2,-1]
dataframe

   n1  n2  n3
0   1  50  10
1   2  51  25
2   3  52   2
3   4  53  -1

We can use the numpy function `np.where` to create new columns

In [133]:
dataframe["n4"] = np.where(dataframe.n1 > 2, True, False)
dataframe

   n1  n2  n3     n4
0   1  50  10  False
1   2  51  25  False
2   3  52   2   True
3   4  53  -1   True

The value selection functions (iat, iloc, loc, at), also
allow you to modify the content of a Daframe , or even
add new elements (rows or columns)

In [134]:
df = pd.DataFrame()
df["Column A"] = [1,2,3,4]
df["Column B"] = ["one", "two", "three", "four"]
df

   Column A Column B
0         1      one
1         2      two
2         3    three
3         4     four

In [135]:
df.iloc[:,0] = [2,1,1,2]
df

   Column A Column B
0         2      one
1         1      two
2         1    three
3         2     four

In [139]:
df.loc["4"] = [5, "five"]
df

   Column A Column B
0         2      one
1         1      two
2         1    three
3         2     four
4         5     five

In [141]:
df.loc[:, "Column C"] = np.random.normal(0.5,10,5)
df

   Column A Column B   Column C
0         2      one  -4.960139
1         1      two -15.176030
2         1    three  -8.491613
3         2     four   0.543886
4         5     five  11.424085

In [142]:
df.iat[0,0] = 79
df

   Column A Column B   Column C
0        79      one  -4.960139
1         1      two -15.176030
2         1    three  -8.491613
3         2     four   0.543886
4         5     five  11.424085

In [143]:
df.iloc[[0,1],0] = 11
df

   Column A Column B   Column C
0        11      one  -4.960139
1        11      two -15.176030
2         1    three  -8.491613
3         2     four   0.543886
4         5     five  11.424085

## Exercise 20 
Use the pokeframe 
- Create a new row with the index "E" and the falues "Adn", "Alibai", "34", "yes", "grass"
- Create the column "hp45", with 45% of the values in column "hp"
- Add 100 to the column "hp if its value is less than 40"

In [188]:
pokeframe

         name   evolution  hp pokedex   type
A   Bulbasaur     Ivysaur  45     Yes  Grass
B  Charmander  Charmeleon  39      No   Fire
C    Squirtle   Wartortle  44     Yes  Water
D   Carterpie     Metapod  45      No    Bug

In [189]:
pokeframe.loc["E", :] = ["Dragonir", "Dragoran", 170, "yes", "dragon"]
pokeframe

         name   evolution     hp pokedex    type
A   Bulbasaur     Ivysaur   45.0     Yes   Grass
B  Charmander  Charmeleon   39.0      No    Fire
C    Squirtle   Wartortle   44.0     Yes   Water
D   Carterpie     Metapod   45.0      No     Bug
E    Dragonir    Dragoran  170.0     yes  dragon

In [190]:
#pokeframe["hp"].astype(int)
pokeframe.loc[:,"hp45"] = np.array(pokeframe["hp"]*0.45)
pokeframe

         name   evolution     hp pokedex    type   hp45
A   Bulbasaur     Ivysaur   45.0     Yes   Grass  20.25
B  Charmander  Charmeleon   39.0      No    Fire  17.55
C    Squirtle   Wartortle   44.0     Yes   Water  19.80
D   Carterpie     Metapod   45.0      No     Bug  20.25
E    Dragonir    Dragoran  170.0     yes  dragon  76.50

In [195]:
pokeframe.loc[:,"hp"] = np.array(pokeframe["hp"]+100 if pokeframe["hp"]<40)

SyntaxError: ignored